Revit 2027 API
ExportPatternInfo.DestinationPatternName Property
 The destination pattern name (the name of the pattern in the exported format).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string DestinationPatternName { get; set; }
Public Property DestinationPatternName As String
	Get
	Set
public:
property String^ DestinationPatternName {
	String^ get ();
	void set (String^ value);
}
member DestinationPatternName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExportPatternInfo Class
Autodesk.Revit.DB Namespace